Revit 2027 API
EffectInstance.SetAmbientColor Method
 Sets the ambient color parameter of the effect instance.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAmbientColor(
	Color color
)
Public Sub SetAmbientColor (
	color As Color
)
public:
void SetAmbientColor(
	Color^ color
)
member SetAmbientColor :
        color : Color -> unit
Parameters
color Color
 The ambient color value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace